//#include<stdio.h>
//int main()
//{
//	unsigned char a = 200;
//	//00000000 00000000 00000000 11001000
//	// 11011000
//	unsigned char b = 100;
//	//00000000 00000000 00000000 01100100
//	// 01100100
//	unsigned char c = 0;
//	c = a + b;
//	// 00000000 00000000 00000000 11001000
//	// 00000000 00000000 00000000 01100100
//	// 00000000 00000000 00000001 00101100  
//
//	// c-00101100
//
//	printf(" % d % d", a + b, c);
//	return 0;
//}


// 打印杨辉三角
//#define N 10
//#include<stdio.h>
//int main()
//{
//	int arr[N][N] = { 0 };
//	int i = 0, j = 0;
//	for (i = 0; i < N; i++)
//	{
//		for (j = 0; j < N; j++)
//		{
//			if (i == j || j == 0)
//			{
//				arr[i][j] = 1;
//			}
//		}
//	}
//	for (i = 2; i < N; i++)
//	{
//		for (j = 1; j <= i - 1; j++)
//		{
//			arr[i][j] = arr[i - 1][j] + arr[i - 1][j - 1];
//		}
//	}
//	for (i = 0; i < N; i++)
//	{
//		for (j = 0; j <= i; j++)
//		{
//			printf("%4d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//}



//日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个嫌疑犯的一个。
//以下为4个嫌疑犯的供词 :
//A说：不是我。
//
//B说：是C。
//
//C说：是D。
//
//D说：C在胡说
//
//已知3个人说了真话，1个人说的是假话。
//
//现在请根据这些信息，写一个程序来确定到底谁是凶手.

//#include<stdio.h>
//int main() {
//	char muder = 'A';
//	for (muder = 'A'; muder <= 'D'; muder++)
//	{
//		if ((muder != 'A') + (muder == 'C') + (muder == 'D') + (muder != 'D') == 3)
//		{
//			printf("muder is %c\n", muder);
//		}
//	}
//	return 0;
//}


//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果:
//A选手说：B第二，我第三；
//
//B选手说：我第二，E第四；
//
//C选手说：我第一，D第二；
//
//D选手说：C最后，我第三；
//
//E选手说：我第四，A第一；
//
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次

#include<stdio.h>
int main()
{
	int a = 0, b = 0, c = 0, d = 0, e = 0;
	for (a = 1; a <= 5; a++)
	{
		for (b = 1; b <= 5; b++)
		{
			if (a != b)
			{
				for (c = 1; c <= 5; c++)
				{
					if (a != c && b != c)
					{
						for (d = 1; d <= 5; d++)
						{
							if (a != d && b != d && c != d)
							{
								for (e = 1; e <= 5; e++)
								{
									if (a != e && b != e && c != e && d != e)
									{
										if (((b == 2) + (a == 3) == 1) &&
											((b == 2) + (e == 4) == 1) &&
											((c == 1) + (d == 2) == 1) &&
											((c == 5) + (d == 3) == 1) &&
											((e == 4) + (a == 1) == 1))
										{
											printf("a = %d b = %d c = %d d = %d e = %d\n", a, b, c, d, e);
										}
									}
								}
							}
						}
					}
				}
			}
		}
	}
}

