#include<stdio.h>
#include<math.h>
int main()
{
	int i = 0;
	for (i = 0; i <= 100000; i++)
	{
		int tmp = i;
		int sum = 0;
		int count = 0;
		while (tmp)
		{
			count++;
			tmp /= 10;
		}
		tmp = i;
		while (tmp)
		{
			sum += pow(tmp % 10, count);
			tmp /= 10;
		}
		if (sum == i)
			printf("%d ", i);
	}
}
#include<stdio.h>
int main()
{
	int a = 0;
	scanf("%d", &a);
	int i = 0, sum = 0, m = 0;
	for (i = 0; i < 5; i++)
	{
		m = m * 10 + a;
		sum += m;
		
	}
	printf("%d", sum);
}

#include<stdio.h>
int main()
{
	int i = 0;
	for (i = 0; i < 7; i++)
	{
		int j = 0;
		for (j = 0; j < 6 - i; j++)
		{
			printf(" ");
		}
		for (j = 0; j < 2 * i + 1; j++)
		{
			printf("*");
		}
		printf("\n");
	}
	for (i = 0; i < 6; i++)
	{
		int j = 0;
		for (j = 0; j <= i; j++)
		{
			printf(" ");
		}
		for (j = 0; j < 11 - 2 * i; j++)
		{
			printf("*");
		}
		printf("\n");
	}
}

#include<stdio.h>
int main()
{
	int a = 20;
	//  00000000 00000000 00000000 00010100    原,反,补,码
	//  0x00 00 00 14                          16进制表示
	int b = -10;
	//  10000000 00000000 00000000 00001010    原码
	//  11111111 11111111 11111111 11110101    反码
	//  11111111 11111111 11111111 11110110    补码
	//  0xff ff ff f6                          16进制表示

}

#include<stdio.h>
int check_sys()
{
	int a = 1;  // 0x 00 00 00 01
	return *(char*)&a;
}
int main()
{
	if (check_sys() == 1)
		printf("小端\n");
	else
		printf("大端\n");
}

#include <stdio.h>
int main()
{
    char a = -1;
      11111111 11111111 11111111 11111111     -1的补码
      a- 11111111                             发生截断
    signed char b = -1;
      11111111 11111111 11111111 11111111     -1的补码
      b- 11111111                             发生截断
    unsigned char c = -1;
     11111111 11111111 11111111 11111111      -1的补码
     c- 11111111                             发生截断
    printf("a=%d,b=%d,c=%d", a, b, c);
       a - 11111111发生整形提升，提升后
       11111111 11111111 11111111 11111111    补码
       转化为原码后打印出来 -1

       b - 11111111发生整形提升，提升后
       11111111 11111111 11111111 11111111    补码
       转化为原码后打印出来 -1

       c - 11111111发生整形提升，提升后
       00000000 00000000 00000000 11111111    补码
       转化为原码后打印出来 255
    return 0;
}


#include <stdio.h>
int main()
{
    char a = -128;
      10000000 00000000 00000000 10000000    -128原码
      11111111 11111111 11111111 01111111    -128反码
      11111111 11111111 11111111 10000000    -128补码
      截断后
      a- 10000000
      整形提升后
      11111111 11111111 11111111 10000000    补码
      以无符号整形的方式打印为 4294967168     
    printf("%u\n", a);
    return 0;
}


#include <stdio.h>
int main()
{
    char a = 128;
     00000000 00000000 00000000 10000000     128补码
      截断
      a- 10000000
      整形提升
     11111111 11111111 11111111 10000000    
     以无符号整形的方式打印为 4294967168 
    printf("%u\n", a);
    return 0;
}

#include<stdio.h>
int main()
{
	int i = -20;
	 10000000 00000000 00000000 00010100   -20的原码
	 11111111 11111111 11111111 11101011   -20的反码
	 11111111 11111111 11111111 11101100   -20的补码
	unsigned  int  j = 10;
	 00000000 00000000 00000000 00001010   10的补码
	printf("%d\n", i + j);
	 11111111 11111111 11111111 11110110   补码
	 11111111 11111111 11111111 11110101   减一
	 10000000 00000000 00000000 00001010   取反
	按照补码的形式进行运算，最后格式化成为有符号整数 -10
	return 0;
}

#include<stdio.h>
int main()
{
	unsigned int i;
	for (i = 9; i >= 0; i--)
	{
		printf("%u\n", i);
	}
	 11111111 11111111 11111111 11111111
	 当i = -1时，将 -1 当成无符号数存储，补码即为原码，为 4294975295
	 i不断递减，从4294975295减到-1,导致死循环产生
}



